Repository: LenKiMo/YOURLS-Upload-and-Shorten
Catalog: i18n/upload-and-shorten-*.po
Languages: de_de

source: Send a file to your webserver and create a short-URL for it.
de_de: Lade eine Datei auf deinen Webserver und erzeuge eine Short-URL dafür.

source: Select a file
de_de: Datei auswählen

source: YOURLS database options
de_de: YOURLS Datenbank-Optionen

source: Custom shortname:
de_de: Benutzerdefinierter Kurzname:

source: Custom title:
de_de: Benutzerdefinierter Titel:

source: Filename conversions (optional)
de_de: Dateinamen ändern (optional)

source: No conversion
de_de: Keine Änderung

source: Filename will not be changed at all.
de_de: Dateinamen nicht verändern.

source: Browser-safe filename
de_de: Browser-sichere Dateinamen

source: Recommended if the file should be accessed by web-browsers.
de_de: Empfohlen wenn die Datei für Web-Browser zugänglich sein soll.

source: Randomize filename
de_de: Zufälliger Dateiname

source: Browser-safe filenames with a slight protection against systematic crawling your web-directory.
de_de: Browser-sichere Dateinamen, zusätzlich etwas Schutz gegen systematisches Ausspähen deines Web-Verzeichnisses.

source: Drop extension
de_de: Erweiterung entfernen

source: Hide the filetype. Can be combined with above options.
de_de: Dateityp verschleiern. Kann mit obigen Optionen kombiniert werden.

source: Some webservers won't send correct headers and web-browsers may not handle the file correctly.
de_de: Manche Web-Server senden dann keine korrekten Header und Web-Browser könnten die Datei nicht richtig darstellen.

source: Go!
de_de: Los!

source: This plugin is hosted at
de_de: Plugin gehostet bei

source: If you like it, remember someone spends his time working on it.
de_de: Wenn es dir gefällt, denk daran, daß jemand seine Zeit dafür hergibt.

source: A cup of coffee might stimulate further improvements. ;-)
de_de: Eine Tasse Kaffee könnte zu weiteren Verbesserungen beitragen. ;-)

source: You need to select a file to upload.
de_de: Du musst eine Datei zum Hochladen auswählen.

source: successfully sent. These are the links to your file:
de_de: erfolgreich hochgeladen. Das sind die Links zu deiner Datei:

source: Direct:
de_de: Direkt:

source: Short:
de_de: Kurz-URL:

source: Upload failed, sorry! The error was
de_de: Upload fehlgeschlagen, sorry! Fehlermeldung:
